app/views/cathegories/index.html.erb

        <td> <% @actcounter=0
                Activity.all.each do |a|
---
SELECT "activities".* FROM "activities"