app/views/cathegories/show.html.erb

SELECT "activities".* FROM "activities"
---
	<% @count=0
		Activity.all.each do |e|