app/views/comments/index.html.erb

      <tr>
        <td><%uss=User.find_by_id(comment.id_creator)%><%= uss.name %></td>
        <td><%acc=Activity.find_by_id(comment.id_activity)%><%= acc.name %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "activities".* FROM "activities" WHERE "activities"."id" = 5 LIMIT 1