app/views/comments/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  <strong>Creator:</strong>
  <%uss=User.find_by_id(@comment.id_creator)%><%= link_to "#{uss.name}", user_path(uss.id) %>

SELECT "activities".* FROM "activities" WHERE "activities"."id" = 16 LIMIT 1
---
  <strong>Activity:</strong>
  <%acc=Activity.find_by_id(@comment.id_activity)%><%= link_to "#{acc.name}", activity_path(acc.id) %>