app/views/users/show.html.erb

SELECT "user_acts".* FROM "user_acts"
---
    @target = nil
    @usacts = UserAct.all