app/views/searches/show.html.erb

SELECT "activities".* FROM "activities"
---
  	  @zero=0
	  @acts=Activity.all

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
			  		#luego el creador
			  		uss=User.find_by_id(a.id_creator)

SELECT "cathegories".* FROM "cathegories" WHERE "cathegories"."id" = 1 LIMIT 1
---
			  		#ahora cathegory
			  		cat=Cathegory.find_by_id(a.id_cathegory)

SELECT "locations".* FROM "locations" WHERE "locations"."id" = 1 LIMIT 1
---
			  		#ahora location
			  		loc = Location.find_by_id(a.id_location)