app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "id_activity", "id_creator", "message", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 26 May 2014 16:43:09 UTC +00:00], ["id_activity", 5], ["id_creator", 3], ["message", "hello"], ["updated_at", Mon, 26 May 2014 16:43:09 UTC +00:00]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save