app/controllers/searches_controller.rb

SELECT "searches".* FROM "searches"
---
  def index
    @searches = Search.all

INSERT INTO "searches" ("actname", "catname", "created_at", "creator", "locname", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["actname", "se"], ["catname", "qq"], ["created_at", Sun, 11 May 2014 21:08:47 UTC +00:00], ["creator", "w"], ["locname", "er"], ["updated_at", Sun, 11 May 2014 21:08:47 UTC +00:00]]
---
  def create
    @search = Search.new(search_params)

    @search.searcher = current_user.name
    respond_to do |format|
      if @search.save

DELETE FROM "searches" WHERE "searches"."id" = ?  [["id", 1]]
---
  def destroy
    @search.destroy

SELECT "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", "8"]]
---
    def set_search
      @search = Search.find(params[:id])