app/views/activities/_form.html.erb

        options=[]
        locs=Location.all
---
SELECT "locations".* FROM "locations"

        options=[]
        cats=Cathegory.all
---
SELECT "cathegories".* FROM "cathegories"