app/views/activities/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "locations".* FROM "locations" WHERE "locations"."id" IS NULL LIMIT 1
---
      <tr>
        <td><%@uss = User.find_by_id(activity.id_creator)%><%= @uss.name %></td>
        <td><%@loc = Location.find_by_id(activity.id_location)%><%= @loc.name %></td>

SELECT "cathegories".* FROM "cathegories" WHERE "cathegories"."id" IS NULL LIMIT 1
---
        <td><%= activity.duration %></td>
        <td><%@cat = Cathegory.find_by_id(activity.id_cathegory)%><%= @cat.name %></td>